<!-- placeholder-1 -->
```fish
terraform plan -chdir=. -refresh=true
```
<!-- placeholder-2 -->

<details open><summary>Diff of 2 changes.</summary>

```diff
+ tailscale_tailnet_key.tailscale_key will be created
! module.n8n_vm.proxmox_virtual_environment_vm.vm is tainted, so must be replaced
```
</details>
<!-- placeholder-3 -->
<details><summary>Plan: 2 to add, 0 to change, 1 to destroy.</br>

<!-- placeholder-4 -->
###### By @b- at 2025-08-19T05:23:59Z [(view log)](https://github.com/perchnet/p/actions/runs/17060382213/job/48365985778#step:11:1).
</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # tailscale_tailnet_key.tailscale_key will be created
  + resource "tailscale_tailnet_key" "tailscale_key" {
      + created_at    = (known after apply)
      + ephemeral     = false
      + expires_at    = (known after apply)
      + expiry        = 600
      + id            = (known after apply)
      + invalid       = (known after apply)
      + key           = (sensitive value)
      + preauthorized = true
      + reusable      = true
      + tags          = [
          + "tag:web-ingress",
        ]
      + user_id       = (known after apply)
    }

  # module.n8n_vm.proxmox_virtual_environment_vm.vm is tainted, so must be replaced
-/+ resource "proxmox_virtual_environment_vm" "vm" {
      ~ id                      = "136" -> (known after apply)
      ~ ipv4_addresses          = [] -> (known after apply)
      ~ ipv6_addresses          = [] -> (known after apply)
      ~ mac_addresses           = [
          - "BC:24:11:98:BD:F8",
        ] -> (known after apply)
        name                    = "n8n-vm"
      ~ network_interface_names = [] -> (known after apply)
        tags                    = [
            "terraform",
        ]
      ~ vm_id                   = 136 -> (known after apply)
        # (24 unchanged attributes hidden)

      ~ cpu {
          - flags        = [] -> null
            # (9 unchanged attributes hidden)
        }

      ~ disk {
          ~ path_in_datastore = "base-9013-disk-1/vm-136-disk-1" -> (known after apply)
            # (14 unchanged attributes hidden)
        }

      ~ initialization {
          + meta_data_file_id    = (known after apply)
          + network_data_file_id = (known after apply)
          + vendor_data_file_id  = (known after apply)
            # (4 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

      ~ network_device {
          - disconnected = false -> null
          ~ mac_address  = "BC:24:11:98:BD:F8" -> (known after apply)
            # (9 unchanged attributes hidden)
        }

        # (7 unchanged blocks hidden)
    }

Plan: 2 to add, 0 to change, 1 to destroy.
```
</details>
<!-- placeholder-5 -->
<!-- terraform-72-3eee8c84341b95e00d4d4dd1307a8268.tfplan -->
<!-- placeholder-6 -->